## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
data.aws_iam_role.task_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_sns_topic.my_sns: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_vpc.myvpc: Reading...
data.aws_security_group.fargate_sg: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
data.aws_security_group.fargate_sg: Read complete after 1s [id=sg-07934f64784cd1b97]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.custom_cloudwatch.aws_cloudwatch_log_group.firelens will be created
  + resource "aws_cloudwatch_log_group" "firelens" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/minecraft-firelens-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-cpu_utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "memory_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-memory_utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "target_group_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_description                     = "This metric monitors ecs health status"
      + alarm_name                            = "minecraft-test-targetgroup_healthy"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/NetworkELB"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count will be created
  + resource "aws_cloudwatch_metric_alarm" "task_running_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + alarm_name                            = "minecraft-test-task_running_count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "minecraft-test-cluster"
          + "ServiceName" = "minecraft-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RunningTaskCount"
      + namespace                             = "ECS/ContainerInsights"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.custom_ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "minecraft-test-cluster"
      + tags     = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.custom_ecs.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "minecraft-test-service"
      + platform_version                   = "LATEST"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "minecraft-test"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "minecraft"
          + container_port   = 25565
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-07934f64784cd1b97",
            ]
          + subnets          = [
              + "subnet-038ab87acb09d9140",
              + "subnet-0b514cfc7d0eb8f87",
            ]
        }
    }

  # module.custom_ecs.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::528163014577:role/minecraft-test-ecs_tasks_execution-role"
      + family                   = "minecraft-test"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::528163014577:role/ecs_tasks-minecraft-test-role"
      + track_latest             = false

      + volume {
          + name = "data"
        }
      + volume {
          + name = "log-volume"
        }
    }

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{ ($.level = \"ERROR\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-0"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = (sensitive value)
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-1"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_lambda_permission.log_permission will be created
  + resource "aws_lambda_permission" "log_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "logs.ap-northeast-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/ecs/minecraft-firelens-logs:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.custom_nlb.null_resource.send_slack_notification will be created
  + resource "null_resource" "send_slack_notification" {
      + id = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/user-action-filter-function"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0] will be created
  + resource "aws_iam_policy" "additional_json" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "user-action-filter-function"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "SNS:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/ecs/minecraft-firelens-logs:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "user-action-filter-function-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "user-action-filter-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_json" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "user-action-filter-function"
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "user-action-filter-function"
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "My awsome lambda function"
      + filename                       = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.zip"
      + function_name                  = "user-action-filter-function"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 360
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALARM_SUBJECT" = "【UserEvent Notification】"
              + "SNS_TOPIC_ARN" = "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic"
              + "WEB_HOOK_URL"  = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../modules/lambda/fixtures/python3.9/index.py",
                      + null,
                    ],
                ]
              + filename      = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.zip"
              + runtime       = "python3.9"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.plan.json"
      + id                   = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.zip"
          + "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        }
    }

  # module.custom_nlb.module.nlb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = false
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "network"
      + name                                                         = "minecraft-test-nlb"
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-038ab87acb09d9140",
          + "subnet-0b514cfc7d0eb8f87",
        ]
      + tags                                                         = {
          + "Name"        = "minecraft-test-nlb"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                                                     = {
          + "Name"        = "minecraft-test-nlb"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 25565
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all          = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 25565
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"        = ""
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-080b3749ba65ae3d7"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "TCP"
          + timeout             = 20
          + unhealthy_threshold = 2
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_cidr_block = "10.0.0.0/16"
  + vpc_id         = "vpc-080b3749ba65ae3d7"
```

</details>